app/views/movies/show.html.erb

	<b>Categories:</b>
	<% @movie.movie_categories.each do |movie_category| %>
---
SELECT "movie_categories".* FROM "movie_categories" WHERE ("movie_categories".movie_id = 11)