app/views/carts/_cart.html.erb

SELECT COUNT(*) FROM "cart_items" WHERE ("cart_items".cart_id = 980190962)
---
<% unless cart.cart_items.empty? %>