app/views/carts/show.html.erb

SELECT "cart_items".* FROM "cart_items" WHERE ("cart_items".cart_id = 1)
---
	</tr>
  <% @cart.cart_items.each do |item| %>