app/controllers/cart_items_controller.rb

  def create
    @cart = current_cart
    movie = Movie.find( params[:movie_id] )
    @cart_item = @cart.add_movie( movie.id )

		resetCounter

    respond_to do |format|
      if @cart_item.save
---
INSERT INTO "cart_items" ("cart_id", "created_at", "updated_at", "movie_id") VALUES (1, '2011-04-28 12:03:03.646548', '2011-04-28 12:03:03.646548', 2)
UPDATE "cart_items" SET "quantity" = 2, "updated_at" = '2011-04-28 13:34:08.041922' WHERE "cart_items"."id" = 4