app/controllers/cart_items_controller.rb

  def index
    @cart_items = CartItem.all
---
SELECT "cart_items".* FROM "cart_items"

  def show
    @cart_item = CartItem.find(params[:id])
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = 980190962 LIMIT 1

  def edit
    @cart_item = CartItem.find(params[:id])
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = 980190962 LIMIT 1

  def create
    @cart = current_cart
    movie = Movie.find( params[:movie_id] )
    @cart_item = @cart.add_movie( movie.id )

		resetCounter

    respond_to do |format|
      if @cart_item.save
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = 905894210 ORDER BY title LIMIT 1
INSERT INTO "cart_items" ("cart_id", "created_at", "updated_at", "movie_id", "quantity", "order_id") VALUES (980190963, '2011-05-16 12:09:18.193139', '2011-05-16 12:09:18.193139', 905894210, 1, NULL)
INSERT INTO "carts" ("created_at", "updated_at") VALUES ('2011-05-07 13:24:48.969345', '2011-05-07 13:24:48.969345')

  def update
    @cart_item = CartItem.find(params[:id])
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = 980190962 LIMIT 1