app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ('MyString', '2011-05-07 13:24:48.000000', '2011-05-07 13:24:48.000000')
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save

SELECT "categories".* FROM "categories" WHERE "categories"."id" = 980190962 LIMIT 1
---
  def update
    @category = Category.find(params[:id])