app/controllers/movies_controller.rb

  def index
    @movies = Movie.all
---
SELECT "movies".* FROM "movies" ORDER BY title

  def show
    @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = 980190962 ORDER BY title LIMIT 1

  def edit
    @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = 980190962 ORDER BY title LIMIT 1

  def create
    @movie = Movie.new(params[:movie])

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("title", "duration", "director", "actors", "overview", "available", "created_at", "updated_at", "code", "image", "rating_id") VALUES ('Test', NULL, NULL, NULL, 'Test', NULL, '2011-05-07 13:24:49.829272', '2011-05-07 13:24:49.829272', NULL, 'Test.png', NULL)

  def update
    @movie = Movie.find(params[:id])

    respond_to do |format|
      if @movie.update_attributes(params[:movie])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = 980190962 ORDER BY title LIMIT 1
UPDATE "movies" SET "title" = 'Test', "overview" = 'Test', "image" = 'Test.png', "updated_at" = '2011-04-21 13:08:56.084857' WHERE "movies"."id" = 980190962

  def destroy
    @movie = Movie.find(params[:id])
    @movie.destroy
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = 980190962 ORDER BY title LIMIT 1
DELETE FROM "movies" WHERE "movies"."id" = 980190962