app/controllers/movie_categories_controller.rb

SELECT "movie_categories".* FROM "movie_categories"
---
  def index
    @movie_categories = MovieCategory.all

SELECT "movie_categories".* FROM "movie_categories" WHERE "movie_categories"."id" = 980190962 LIMIT 1
---
  def show
    @movie_category = MovieCategory.find(params[:id])

SELECT "movie_categories".* FROM "movie_categories" WHERE "movie_categories"."id" = 980190962 LIMIT 1
---
  def edit
    @movie_category = MovieCategory.find(params[:id])

INSERT INTO "movie_categories" ("movie_id", "category_id", "created_at", "updated_at") VALUES (1, 1, '2011-05-07 13:24:48.000000', '2011-05-07 13:24:48.000000')
---
  def create
    @movie_category = MovieCategory.new(params[:movie_category])

    respond_to do |format|
      if @movie_category.save

SELECT "movie_categories".* FROM "movie_categories" WHERE "movie_categories"."id" = 980190962 LIMIT 1
---
  def update
    @movie_category = MovieCategory.find(params[:id])

SELECT "movie_categories".* FROM "movie_categories" WHERE "movie_categories"."id" = 980190962 LIMIT 1
DELETE FROM "movie_categories" WHERE "movie_categories"."id" = 980190962
---
  def destroy
    @movie_category = MovieCategory.find(params[:id])
    @movie_category.destroy