app/controllers/orders_controller.rb

  def index
    @orders = Order.paginate :page => params[:page], :order => 'created_at desc', :per_page => 10
---
SELECT "orders".* FROM "orders"

  def new
  	@cart = current_cart
    @hide_checkout = true

  	if @cart.cart_items.empty?
---
SELECT "cart_items".* FROM "cart_items" WHERE ("cart_items".cart_id = 980190963)
SELECT COUNT(*) FROM "cart_items" WHERE ("cart_items".cart_id = 980190963)

  def create
    @order = Order.new(params[:order])
		@order.add_cart_items_from_cart( current_cart )
    # need to ensure that user is logged in
    @order.user_id = session[:user_id]

    respond_to do |format|
      if @order.save
      	# Cart is transient - Order is permanent
        Cart.destroy(session[:cart_id])

      	# would be better if there is a manager that handles the session manager - session helper maybe?
        session[:cart_id] = nil

        Notifier.order_received(@order).deliver
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES ('2011-05-16 13:23:48.937736', '2011-05-16 13:23:48.937736')
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES ('MyString', 'MyText', 'MyString', 'MyString', '2011-05-16 12:09:18.000000', '2011-05-16 12:09:18.000000')
DELETE FROM "carts" WHERE "carts"."id" = 980190963
SELECT "cart_items".* FROM "cart_items" WHERE ("cart_items".cart_id = 980190963)