app/controllers/store_controller.rb

	def index
		@movies = Movie.all
---
SELECT "movies".* FROM "movies" ORDER BY title