app/views/store/index.html.erb

<%= debug session %>
<%= debug Cart.find(11) %>
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = 11 LIMIT 1